ASC_CalculationAlgorithms/Documents/КорректировкаРеализации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>КорректировкаРеализации</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументРеализации</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДоИзменения</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>АгентскиеУслуги</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДоИзменения</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ASC_CalculationAlgorithms/Documents/КорректировкаРеализации/Ext/ObjectModule.bsl
&После("ОбработкаПроведения")
Процедура АСЦ_ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Добавим движения по КУДиР
	// считаем, что документ уже оплачен, ибо создаются по оплаченным полисам
	Движения.КнигаУчетаДоходовИРасходов.Записывать = Истина;
	
	Если УчетнаяПолитика.ПрименяетсяУСН(Организация, Дата) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Параметры.Вставить("Ссылка", Ссылка);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ДокУслуги.Ссылка.Дата КАК Период,
		|	ДокУслуги.Ссылка.ДокументРеализации.Дата КАК ОснованиеДата,
		|	ДокУслуги.Ссылка.ДокументРеализации.Номер КАК ОснованиеНомер,
		|	ДокУслуги.Ссылка.Организация КАК Организация,
		|	ДокУслуги.Ссылка.Контрагент КАК Контрагент,
		|	ДокУслуги.Ссылка.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	ДокУслуги.Сумма - ДокУслуги.СуммаДоИзменения КАК Графа5
		|ИЗ
		|	Документ.КорректировкаРеализации.Услуги КАК ДокУслуги
		|ГДЕ
		|	ДокУслуги.Ссылка = &Ссылка
		|	И ДокУслуги.Сумма - ДокУслуги.СуммаДоИзменения <> 0";
	
		Таблица = Запрос.Выполнить().Выгрузить();
		Для каждого СтрокаТЗ из Таблица Цикл
			
			Запись = Движения.КнигаУчетаДоходовИРасходов.Добавить();
			ЗаполнитьЗначенияСвойств(Запись, СтрокаТЗ);
			
			Запись.Содержание = "Корректировка вознаграждения. Оплата от покупателя """ + Строка(СтрокаТЗ.Контрагент) + """ по договору """ + Строка(СтрокаТЗ.ДоговорКонтрагента) + """";
			Запись.РеквизитыПервичногоДокумента = Формат(СтрокаТЗ.ОснованиеДата, "ДФ=dd.MM.yyyy") + ", № " +  ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(СтрокаТЗ.ОснованиеНомер, Истина, Ложь);
			
		КонецЦикла;	
		
	КонецЕсли;
	
	Движения.КнигаУчетаДоходовИРасходов.Записать();
	
КонецПроцедуры
